In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.Series()

In [3]:
df                    ## Obj because it creates obj of pandas class and it can store any value so by def dtype Obj

Series([], dtype: object)

In [4]:
type(df)

pandas.core.series.Series

In [6]:
df=pd.Series(5)
df

0    5
dtype: int64

In [7]:
df=pd.Series((1,4,5))
df

0    1
1    4
2    5
dtype: int64

In [8]:
df=pd.Series(([1,2,3],[6,9,12,],[15,18,21]))

In [9]:
df

0       [1, 2, 3]
1      [6, 9, 12]
2    [15, 18, 21]
dtype: object

In [11]:
data={'Name':['A','B','C','D'],'Age':np.random.randint(20,35,4)}
data

{'Name': ['A', 'B', 'C', 'D'], 'Age': array([32, 22, 34, 32])}

In [15]:
df=pd.DataFrame(data)            # In DataFrame , it creates index starting from 0

In [16]:
df

  Name  Age
0    A   32
1    B   22
2    C   34
3    D   32

In [24]:
df.iloc[:,0]

0    A
1    B
2    C
3    D
Name: Name, dtype: object

## Data Frame

In [4]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
my_data=[['ab',1],['cd',2],['ef',3],['gh',4],['ij',5]]
df=pd.DataFrame(my_data)

In [7]:
df

    0  1
0  ab  1
1  cd  2
2  ef  3
3  gh  4
4  ij  5

In [9]:
df=pd.DataFrame(my_data,columns=['A','B'],index=[1,2,3,4,5])
df

    A  B
1  ab  1
2  cd  2
3  ef  3
4  gh  4
5  ij  5

In [15]:
df.iloc[:,:1]

    A
1  ab
2  cd
3  ef
4  gh
5  ij

In [16]:
data={'Emp_Id':[101,102,103,104,105],'Emp_Name':['Rohan','Pooja','Arjun','Simran','Alex'],
      'Emp_Dept':['Dev','HR','R&D','Dev','HR'],'Emp_Sal':[650000,425000,900000,650000,425000],
      'Emp_Contact':[9486513468,8168534786,7481653489,9974856165,9168651654]}

In [17]:
df=pd.DataFrame(data)

In [18]:
df

   Emp_Id Emp_Name Emp_Dept  Emp_Sal  Emp_Contact
0     101    Rohan      Dev   650000   9486513468
1     102    Pooja       HR   425000   8168534786
2     103    Arjun      R&D   900000   7481653489
3     104   Simran      Dev   650000   9974856165
4     105     Alex       HR   425000   9168651654

In [66]:
stud={'Name':['Alex','Bob','Kelly','Boris','Ken'],'Age':np.random.randint(12,15,5),'Subject':['Maths','Science','Eco','Geo','English']}
df=pd.DataFrame(stud)
df

    Name  Age  Subject
0   Alex   13    Maths
1    Bob   14  Science
2  Kelly   12      Eco
3  Boris   14      Geo
4    Ken   14  English

In [67]:
df.insert(0,'s_i',list(np.arange(1,6)))

In [68]:
df

   s_i   Name  Age  Subject
0    1   Alex   13    Maths
1    2    Bob   14  Science
2    3  Kelly   12      Eco
3    4  Boris   14      Geo
4    5    Ken   14  English

In [69]:
df['Gender']=np.where(df['Age']>13,'Male','Female')
df

   s_i   Name  Age  Subject  Gender
0    1   Alex   13    Maths  Female
1    2    Bob   14  Science    Male
2    3  Kelly   12      Eco  Female
3    4  Boris   14      Geo    Male
4    5    Ken   14  English    Male

In [70]:
df['Maths']=np.random.randint(60,101,5)
df['Physics']=np.random.randint(60,101,5)
df['Chemistry']=np.random.randint(60,101,5)

In [72]:
df

   s_i   Name  Age  Subject  Gender  Maths  Physics  Chemistry
0    1   Alex   13    Maths  Female     78      100         91
1    2    Bob   14  Science    Male     72       74         69
2    3  Kelly   12      Eco  Female     92       98         92
3    4  Boris   14      Geo    Male     98       72         88
4    5    Ken   14  English    Male     99       81         68

In [73]:
df['Percent']=np.round(((df['Maths']+df['Physics']+df['Chemistry'])/300)*100,2)
df

   s_i   Name  Age  Subject  Gender  Maths  Physics  Chemistry  Percent
0    1   Alex   13    Maths  Female     78      100         91    89.67
1    2    Bob   14  Science    Male     72       74         69    71.67
2    3  Kelly   12      Eco  Female     92       98         92    94.00
3    4  Boris   14      Geo    Male     98       72         88    86.00
4    5    Ken   14  English    Male     99       81         68    82.67

In [75]:
df['Grade']=['A+' if x>90 else 'A' if x>80 else 'B+' if x>70 else "B" for x in df['Percent']]

In [76]:
df

   s_i   Name  Age  Subject  Gender  Maths  Physics  Chemistry  Percent Grade
0    1   Alex   13    Maths  Female     78      100         91    89.67     A
1    2    Bob   14  Science    Male     72       74         69    71.67    B+
2    3  Kelly   12      Eco  Female     92       98         92    94.00    A+
3    4  Boris   14      Geo    Male     98       72         88    86.00     A
4    5    Ken   14  English    Male     99       81         68    82.67     A